Revit 2024 API
RebarConstraint.ConstrainsRebarEnds Method
 Returns true if this constraint constrains two rebar ends.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public bool ConstrainsRebarEnds()
Visual Basic
Public Function ConstrainsRebarEnds As Boolean
Visual C++
public:
bool ConstrainsRebarEnds()
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace